In [1]:
from pandas import DataFrame

In [2]:
dframe = DataFrame({'city':['Alma', 'Brian Head', 'Fox Park'],
                   'altitude':[3158, 3000,2752]})

In [3]:
dframe

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2752    Fox Park

In [4]:
state_map={'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park': 'Wyoming'}

In [6]:
dframe['state'] = dframe['city'].map(state_map)

In [7]:
dframe

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2752    Fox Park   Wyoming

In [8]:
dframe['key1'] = [0, 1, 2]

In [9]:
dframe

   altitude        city     state  key1
0      3158        Alma  Colorado     0
1      3000  Brian Head      Utah     1
2      2752    Fox Park   Wyoming     2